//app.js
App({
  onLaunch: function () {
    // 展示本地存储能力
    var logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
    // 获取用户信息
    wx.getSetting({
      success: res => {
        if (res.authSetting['scope.userInfo']) {
          // 已经授权，可以直接调用 getUserInfo 获取头像昵称，不会弹框
          wx.getUserInfo({
            success: res => {
              // 可以将 res 发送给后台解码出 unionId
              this.globalData.userInfo = res.userInfo

              // 由于 getUserInfo 是网络请求，可能会在 Page.onLoad 之后才返回
              // 所以此处加入 callback 以防止这种情况
              if (this.userInfoReadyCallback) {
                this.userInfoReadyCallback(res)
              }
            }
          })
        }
      }
    })
  },
  globalData: {
    userInfo: "hello", 
    question_toutong: [{ 
        "question": "头痛症状最早发生时间为？", 
          "option": { 
            "A": "1天之内",
            "B": "1天-11天", 
            "C": "11天-5年", 
            "D": "大于5年", 
            "E": "不清楚" } 
            }, { 
              "question": "请问头痛的发生情况为？", 
              "option": { 
                "A": "受凉", 
                "B": "劳累", 
                "C": "活动", 
                "D": "感冒", 
                "E": "睡眠", 
                "F": "不明原因" } }, {
      "question": "请问头痛符合以下哪种描述？",
      "option": {
        "A": "胀痛(头部出现膨胀感并伴随疼痛)",
        "B": "钝痛(头部出现程度较剧烈但不尖锐的疼痛)",
        "C": "隐痛(头部出现隐隐约约的疼痛)",
        "D": "刺痛(头部出现细针刺皮肤一样的疼痛)",
        "E": "闷痛(头部出现被压迫一样的疼痛)",
        "F": "都无"
      }
    }, {
      "question": "请问头痛症状持续时间为？",
        "option": {
          "A": "每次持续约数小时至数天",
          "B": "每次持续数分钟",
          "C": "每次持续数小时",
          "D": "每次持续数十秒",
          "E": "都无"
        }
      }, {
        "question": "请问以下哪种情况下头痛症状加重？",
        "option": {
          "A": "活动",
          "B": "夜间",
          "C": "平躺",
          "D": "白天",
          "E": "低头",
          "F": "劳累",
          "G": "都无"
        }
      }, {
        "question": "请问头痛主要发生在什么部位？",
        "option": {
          "A": "头顶部",
          "B": "双侧额颞部",
          "C": "额部",
          "D": "左侧额颞部",
          "E": "右侧额颞部",
          "F": "双侧额颞部",
          "G": "全头部",
          "H": "都无"
        }
      }, {
        "question": "请问头痛的程度？",
        "option": {
          "A": "较重",
          "B": "中等",
          "C": "轻",
          "D": "都无"
        }
      }], 
    question_kesou: [{
      "question": "咳嗽症状最早发生时间为？",
        "option": {
          "A": "3天之内",
          "B": "3天-5天",
          "C": "5天-10天",
          "D": "大于10天",
          "E": "不清楚"
        }
      }, {
        "question": "请问咳嗽的发生情况为？",
        "option": {
          "A": "受凉",
          "B": "感冒",
          "C": "不明原因",
          "D": "其他原因"
        }
      }, {
        "question": "请问咳嗽症状持续时间为？",
        "option": {
          "A": "阵发性",
          "B": "持续性",
          "C": "都无"
        }
      }, {
        "question": "请问关于咳嗽的以下描述正确的为？",
        "option": {
          "A": "咳白色粘痰",
          "B": "咳黄色粘痰",
          "C": "咳黄白色粘痰",
          "D": "痰中带鲜红色血丝",
          "E": "都无"
        }
      }, {
        "question": "请问咳嗽症状每次持续时间为？",
        "option": {
          "A": "单声咳(咳嗽时只咳一声)",
          "B": "连声咳(连续不断的咳嗽)",
          "C": "阵咳(一阵一阵咳嗽)",
          "D": "都无"
        }
      }, {
        "question": "请问什么情况下咳嗽加重？",
        "option": {
          "A": "夜晚",
          "B": "活动",
          "C": "白天",
          "D": "清晨起床",
          "E": "都无"
        }
      }, {
        "question": "请问咳嗽的程度？",
        "option": {
          "A": "较重",
          "B": "中等",
          "C": "轻",
          "D": "都无"
        }
      }], 
    question_touyun: [{
      "question": "头晕症状最早发生时间为？",
      "option": {
        "A": "3天",
        "B": "一周",
        "C": "几个月",
        "D": "几年"
      }
    }, {
      "question": "请问头晕发生情况为？",
      "option": {
        "A": "感冒",
        "B": "饮酒",
        "C": "排便",
        "D": "休息",
        "E": "劳累",
        "F": "不明原因",
        "G": "其他原因"
      }
    }, {
        "question": "请问头晕症状持续时间为？",
      "option": {
        "A": "阵发性",
        "B": "持续性",
        "C": "都无"
      }
    }, {
      "question": "请问您什么情况下头晕加重？",
      "option": {
        "A": "坐起及睁眼",
        "B": "行走",
        "C": "改变体位及活动",
        "D": "平躺及活动",
        "E": "低头",
        "F": "紧张或劳累",
        "G": "都无"
      }
    }, {
      "question": "请问您什么情况下头晕缓解？",
      "option": {
        "A": "休息",
        "B": "平躺",
        "C": "都无"
      }
    }, {
      "question": "请问您头晕的程度是？",
      "option": {
        "A": "较重",
        "B": "中等",
        "C": "轻",
        "D": "都无"
      }
    }],
    question_xinji: [{ 'question': '请问您心悸症状最早发生时间？', 'option': { 'A': '两天之内', 'B': '两天到一个月', 'E': '不清楚', 'C': '一个月到两个月', 'D': '大于两月' } },
{ 'question': '心悸发生情况为？', 'option': { 'A': '运动', 'B': '劳累', 'F': '不明原因', 'G': '其他原因', 'C': '饮酒', 'D': '精神刺激', 'E': '排便' } },
{ 'question': '请问心悸症状持续时间为？', 'option': { 'A': '阵发性', 'B': '持续性','C': '都无'} },
{ 'question': '什么情况下心悸缓解？', 'option': { 'A': '休息', 'B': '蹲下',  'C': '都无'} },
{ 'question': '什么情况下心悸加重？', 'option': { 'A': '活动', 'B': '休息','C': '活动或劳累', 'D': '都无'} }], 
    question_xiongmen: [{ 'option': { 'B': '10天-2年', 'C': '2年-6年', 'A': '10天之内', 'E': '不清楚', 'D': '大于6年' }, 'question': '请问您胸闷最早发生时间？' },
{ 'option': { 'B': '活动', 'C': '受凉', 'G': '其他原因', 'F': '不明原因', 'E': '劳累', 'D': '散步', 'A': '休息' }, 'question': '胸闷发生情况为？' },
{ 'option': { 'B': '剑突下', 'C': '心前区', 'A': '胸骨中下段', 'D': '都无' }, 'question': '胸闷发生在什么部位？' },
{ 'option': { 'B': ' 闷胀感 ', 'C': '压迫感', 'A': '紧缩感', 'D': '都无' }, 'question': '闷感符合下列哪种描述？' },
{ 'option': { 'B': '每次持续约数分钟', 'C': '每次持续数小时', 'A': '每次持续约数秒钟', 'D': '都无' }, 'question': '胸闷每次持续时间为？' },
{ 'option': { 'B': '活动及劳累', 'C': '都无', 'A': '深呼吸' }, 'question': '什么情况下胸闷加重？' },
{ 'option': { 'B': '程度较轻', 'C': '都无', 'A': '程度较重' }, 'question': '请问您胸闷的程度？' }], 
    question_ketan: [{ 'option': { 'E': '不清楚', 'D': '大于10年', 'B': '6天-3月', 'A': '6天之内', 'C': '3月-10年' }, 'question': '请问您咳痰最早发生时间？' },
{ 'option': { 'D': '其他原因', 'B': '饮酒', 'A': '受凉', 'C': '不明原因' }, 'question': '咳痰发生情况为？' },
{ 'option': { 'B': '痰中带鲜红色血丝', 'A': '痰为白色粘痰', 'C': '都无' }, 'question': '痰的性状为？' },
{ 'option': { 'B': '痰不易咳出', 'A': '易咳出', 'C': '都无' }, 'question': '咳痰符合下列哪种描述？' },
{ 'option': { 'B': '持续性', 'A': '阵发性', 'C': '都无' }, 'question': '请问咳痰症状持续时间为？' }],
  question_hxkn: [{ 'option': { 'D': '大于10天', 'C': '2天-10天', 'A': '1天之内', 'E': '不清楚', 'B': '1天-2天' }, 'question': '请问关于呼吸困难症状持续时间为？' },
{ 'option': { 'D': '劳累', 'C': '感冒', 'E': '睡眠', 'B': '受凉', 'F': '不明原因', 'A': '活动', 'G': '其他原因' }, 'question': '呼吸困难发生情况为？' }],
  question_tzxj: [{ 'question': '请问您体重下降最早发生时间？', 'option': { 'B': '2月-12月', 'C': '12月-2年', 'A': '2月之内', 'E': '不清楚', 'D': '大于2年' } },
{ 'question': '体重下降发生情况？', 'option': { 'B': '厌食', 'C': '消化功能障碍', 'A': '受凉' } }],
  question_fare: [{ 'question': '请问您发热最早发生时间为？', 'option': { 'B': '1天-3天', 'C': '大于3天', 'A': '1天之内', 'D': '不清楚' } },
{ 'question': '发热发生情况？', 'option': { 'B': '受凉', 'C': '感冒', 'E': '暴晒', 'A': '劳累', 'D': '打农药', 'F': '不明原因', 'G': '其他原因' } },
{ 'question': '什么情况下发热加重？', 'option': { 'B': '下午及晚上', 'C': '午后', 'A': '夜间', 'D': '都没有' } },
{ 'question': '发热症状持续时间描述？', 'option': { 'B': '持续性', 'C': '都无', 'A': '阵发性' } },
    { 'question': '发热具体体温为？', 'option': { 'A': '38°', 'B': '39°', 'C': '40°', 'D': '41°', 'E': '41°以上' } }],
    question_chuanxi: [{ 'option': { 'A': '3天之内', 'B': '3天-6天', 'E': '不清楚', 'C': '6天-3年', 'D': '大于3年' }, 'question': '请问您喘息最早发生时间为？' },
{ 'option': { 'F': '其他原因', 'D': '劳累', 'A': '受凉', 'B': '感冒', 'E': '不明原因', 'C': '活动' }, 'question': '喘息发生情况？' },
{ 'option': { 'F': '都没有', 'D': '平卧', 'A': '活动', 'B': '稍活动', 'E': '晨起及夜间入睡', 'C': '用力' }, 'question': '什么情况下喘息加重？' },
{ 'option': { 'A': '经休息', 'B': '左右侧卧位或坐起', 'C': '都无' }, 'question': '什么情况下喘息缓解？' },
{ 'option': { 'A': '阵发性', 'B': '持续性', 'C': '都无' }, 'question': '喘息症状持续时间？' }],
    question_kaxie: [{ 'option': { 'B': '1天-3天', 'A': '1天之内', 'C': '3天-3月', 'E': '不清楚', 'D': '大于3月' }, 'question': '请问您咯血最早发生时间为？' },
{ 'option': { 'B': '进食进水', 'A': '感冒', 'G': '其他原因', 'E': '负重', 'F': '不明原因', 'C': '外伤', 'D': '受凉' }, 'question': '咯血发生情况？' },
{ 'option': { 'B': '暗红色为多', 'A': '咯鲜红色血液', 'C': '都无' }, 'question': '血的性状为？' },
{ 'option': { 'B': '量少', 'A': '量多', 'C': '都无' }, 'question': '咯血的程度为？' },
{ 'option': { 'B': '晨起', 'A': '夜间', 'C': '都无' }, 'question': '什么情况下咯血加重？' }],
    question_yanshi: [{ 'option': { 'C': '4天-10天', 'B': '3天-4天', 'E': '不清楚', 'A': '3天之内', 'D': '大于10天' }, 'question': '请问您厌食最早发生时间为？' },
{ 'option': { 'B': '饮食不当', 'C': '感冒', 'G': '其他原因', 'E': '劳动', 'A': '劳累', 'F': '不明原因', 'D': '受凉' }, 'question': '厌食发生情况？' },
{ 'option': { 'C': '饮酒', 'B': '油腻食物', 'A': '进食', 'D': '都无' }, 'question': '什么情况下厌食加重？' }],
    question_penti: [{ 'question': '请问您喷嚏最早发生时间为？', 'option': { 'C': '1年-3年', 'B': '7天-1年', 'A': '7天之内', 'E': '不清楚', 'D': '大于3年' } },
{ 'question': '喷嚏发生情况？', 'option': { 'C': '不明原因', 'B': '受凉', 'A': '感冒', 'D': '其他原因' } }],
    question_bisai: [{ 'option': { 'C': '1年-3年', 'E': '不清楚', 'A': '4天之内', 'D': '大于3年', 'B': '4天-1年' }, 'question': '请问您鼻塞最早发生时间？' },
{ 'option': { 'C': '受凉', 'E': '其他原因', 'A': '感冒', 'D': '不明原因', 'B': '活动' }, 'question': '鼻塞发生情况？' },
{ 'option': { 'C': '都无', 'A': '阵发性', 'B': '持续性' }, 'question': '鼻塞症状持续时间？' },
{ 'option': { 'C': '感冒', 'A': '夜间', 'D': '都无', 'B': '睡眠' }, 'question': '什么情况下鼻塞加重？' },
{ 'option': { 'A': '黄色脓涕', 'B': '黄色稀涕' }, 'question': '鼻涕的性状为？' }],
    question_yantong: [{ 'question': '请问您咽痛最早发生时间为？', 'option': { 'E': '不清楚', 'D': '大于3月', 'A': '4天之内', 'B': '4天-10天', 'C': '10天-3月' } },
{ 'question': '咽痛发生情况？', 'option': { 'F': '不明原因', 'C': '活动', 'B': '吃海鲜', 'E': '进食', 'G': '其他原因', 'A': '感冒', 'D': '进食进水' } },
{ 'question': '什么情况下咽痛加重？', 'option': { 'F': '感冒或劳累', 'C': '饮食及饮水', 'B': '进食', 'E': '刺激', 'G': '都无', 'A': '吞咽', 'D': '转颈及吞咽' } },
{ 'question': '咽痛症状持续时间？', 'option': { 'A': '阵发性', 'B': '持续性', 'C': '都无' } },
{ 'question': '疼痛的程度为？', 'option': { 'A': '胀痛', 'B': '刺痛', 'C': '都无' } },
{ 'question': '什么情况下咽痛缓解？', 'option': { 'A': '休声', 'B': '休息', 'C': '都无' } }],
    question_exot: [{ 'option': { 'E': '不清楚', 'B': '2天-4天', 'C': '4天-7天', 'D': '大于7天', 'A': '2天之内' }, 'question': '请问您恶心呕吐最早发生时间为？' },
{ 'option': { 'C': '感冒', 'A': '饮酒', 'F': '不明原因', 'G': '其他原因', 'B': '受凉', 'E': '饮食不当', 'D': '不洁饮食' }, 'question': '恶心呕吐发生情况？' },
{ 'option': { 'B': '晨起', 'C': '餐后', 'D': '都无', 'A': '进食油腻食物' }, 'question': '什么情况下恶心呕吐加重？' },
{ 'option': { 'B': '持续性', 'C': '都无', 'A': '阵发性' }, 'question': '恶心呕吐症状持续时间？' },
{ 'option': { 'B': '呕吐量少 ', 'C': '呕吐量中 ', 'D': '都无', 'A': '呕吐量较多 ' }, 'question': '呕吐量描述？' },
{ 'option': { 'B': '呕吐物有黑色血块', 'C': '呕吐物其中夹有暗红色血块', 'D': '都无', 'A': '呕吐物有咖啡色液体' }, 'question': '呕吐物性状为？' },
{ 'option': { 'B': '喷射状', 'C': '都无', 'A': '非喷射性 ' }, 'question': '呕吐程度？' }], 
    question_fuxie: [
	{
	"question": "请问您的年龄段是？",
	"option": {
		"A": "0-6岁",
		"B": "7-15岁",
		"C": "16-35岁",
		"D": "36-60岁",
		"E": "大于60岁"
	}},
	{
	"question": "症状最早发生时间为?",
	"option": {
		"A": "1天之内",
		"B": "1天-2天",
		"C": "2天-4天",
		"D": "大于4天",
		"E": "不清楚"
	}},
	
	{"question": "请问以下哪种情况出现腹泻?",
	"option": {
		"A": "受凉",
		"B": "饮食不当",
		"C": "不洁饮食",
		"D": "天气变化",
		"E": "进食进水",
		"F": "不明原因",
		"J": "其他原因",
	}},
	{"question": "请问症状发生描述为？",
	"option": {
		"A": "解黄色稀水便",
		"B": "偶大便中夹带鲜红色血",
		"C": "便中夹杂白色粘液",
		"E": "都无"
	}},
	{"question": "请问症状的发生频率为?",
	"option": {
		"A": "约1-3次/天",
		"B": "大于3次/天",
		"F": "都不是"
	}},
	{"question": "请问症状的程度为?",
	"option": {
		"A": "量少 （ 少于正常大便量 ）",
		"B": "量多 （ 多于正常大便量 ）",
		"C": "量中等 （ 约等于正常大便量 ）",
		"D": "都无"
	}},
	{"question": "请问什么情况下腹泻加重?",
	"option": {
		"A": "夜间",
		"B": "饱餐",
		"E": "都无"
	}},
	{"question": "请问腹泻有无其他伴随症状?",
	"option": {
		"A": "呕吐",
		"B": "流涕",
		"C": "恶心",
		"D": "呕吐",
		"E": "都无"
	}}
], 
question_duoniao: [
{
	"question": "请问您的年龄段是？",
	"option": {
		"A": "0-6岁",
		"B": "7-15岁",
		"C": "16-35岁",
		"D": "36-60岁",
		"E": "大于60岁"
}},
{"question": "症状最早发生时间为?",
	"option": {
		"A": "1月之内",
		"B": "1月-8年",
		"C": "8年-10年",
		"D": "大于10年",
		"E": "不清楚"
}},
{"question": "请问多尿的程度为?",
	"option": {
		"A": "每日尿量少于3000ml",
		"B": "每日尿量3000ml以上 （ 每日尿量多于6矿泉水瓶 ）",
		"C": "都无"
}},
{"question": "请问症状发生描述为？",
	"option": {
		"A": "为淡黄色尿",
		"B": "尿色淡红色",
		"E": "都无"
}},
{"question": "请问多尿有无其他伴随症状?",
	"option": {
		"A": "多饮 （ 饮水较平时明显增多 ）",
		"B": "口干",
		"C": "多食（ 饮食较平时明显增多 ）",
		"D": "烦渴（ 持续长时间的过度口渴并且烦躁 ）",
		"E": "都无"
}}
],
  question_xiongtong: [{
	  "question": "请问您的年龄段是？",
	"option": {
		"A": "0-6岁",
		"B": "7-15岁",
		"C": "16-35岁",
		"D": "36-60岁",
		"E": "大于60岁"
  }},
	{"question": "症状最早发生时间为?",
	"option": {
		"A": "1天之内",
		"B": "1天-2天",
		"C": "2天-4天",
		"D": "大于4天",
		"E": "不清楚"
  }},
		{"question": "请问以下哪种情况出现腹泻?",
	"option": {
		"A": "受凉",
		"B": "饮食不当",
		"C": "不洁饮食",
		"D": "天气变化",
		"E": "进食进水",
		"F": "不明原因",
		"J": "其他原因",
  }},
	{"question": "请问症状发生描述为？",
	"option": {
		"A": "解黄色稀水便",
		"B": "偶大便中夹带鲜红色血",
		"C": "便中夹杂白色粘液",
		"E": "都无"
  }},
	{"question": "请问症状的发生频率为?",
	"option": {
		"A": "约1-3次/天",
		"B": "大于3次/天",
		"F": "都不是"
  }},
	{"question": "请问症状的程度为?",
	"option": {
		"A": "量少 （ 少于正常大便量 ）",
		"B": "量多 （ 多于正常大便量 ）",
		"C": "量中等 （ 约等于正常大便量 ）",
		"D": "都无"
  }},
	{"question": "请问什么情况下腹泻加重?",
	"option": {
		"A": "夜间",
		"B": "饱餐",
		"E": "都无"
  }},
	{"question": "请问腹泻有无其他伴随症状?",
	"option": {
		"A": "呕吐",
		"B": "流涕",
		"C": "恶心",
		"D": "腹痛",
		"E": "都无"
	}
}],
  question_bianmi: [{
	"question": "请问您的年龄段是？",
	"option": {
		"A": "0-6岁",
		"B": "7-15岁",
		"C": "16-35岁",
		"D": "36-60岁",
		"E": "大于60岁"
  }},
	{"question": "症状最早发生时间为?",
	"option": {
		"A": "10天之内",
		"B": "10天-4月",
		"C": "4月-4年",
		"D": "大于4年",
		"E": "不清楚"
  }},
	{"question": "请问以下哪种情况出现便秘?",
	"option": {
		"A": "大便",
		"B": "腰椎手术",
		"C": "受凉",
		"D": "不明原因",
		"E": "其他原因",
  }},
	{"question": "请问症状发生程度为？",
	"option": {
		"A": "大便2-5天一次",
		"B": "大便每日一次",
		"C": "大便大于5天一次",
		"D": "都不是"
  }},
	{"question": "请问症状的描述为?",
	"option": {
		"A": "排黄色干便",
		"B": "排黑色羊粪状大便",
		"C": "为暗黄色干结状便",
		"D": "便中带鲜红色或暗红色血",
		"E": "都无"
  }},
	{"question": "请问伴随症状为?",
	"option": {
		"A": "多饮",
		"B": "多尿",
		"C": "呕吐",
		"D": "都无"
	}
}],
question_futong: [{
	"question": "请问您的年龄段是？",
	"option": {
		"A": "0-6岁",
		"B": "7-15岁",
		"C": "16-35岁",
		"D": "36-60岁",
		"E": "大于60岁"
}},
	{"question": "症状最早发生时间为?",
	"option": {
		"A": "4小时之内",
		"B": "4小时-10小时",
		"C": "10小时-1天",
		"D": "大于1天",
		"E": "不清楚"
}},
	{"question": "请问以下哪种情况出现腹痛?",
	"option": {
		"A": "进食油腻",
		"B": "饮食不当",
		"C": "外伤",
		"D": "感冒",
		"E": "受凉",
		"F": "不明原因",
		"J": "其他原因",
}},
	{"question": "请问症状发生程度为？",
	"option": {
		"A": "隐痛 （ 肚子出现隐隐约约的疼痛 ）",
		"B": "胀痛 （ 有膨胀感并伴随疼痛 ）",
		"C": "绞痛 （ 肚子出现肌肉被拧一样的疼痛 ）",
		"E": "都无"
}},
	{"question": "请问什么情况下腹痛缓解?",
	"option": {
		"A": "进食",
		"B": "便后",
		"C": "弯腰屈膝位",
		"D": "晨起",
		"E": "都无"
}},
	{"question": "请问腹痛的程度为?",
	"option": {
		"A": "程度中等",
		"B": "程度较重",
		"C": "程度较轻",
		"D": "都无"
}},
	{"question": "请问什么情况下腹痛加重?",
	"option": {
		"A": "进食",
		"B": "空腹",
		"C": "活动",
		"D": "夜晚",
		"E": "进食辛辣食物"
}},
	{"question": "请问腹泻有无其他伴随症状?",
	"option": {
		"A": "呕吐",
		"B": "流涕",
		"C": "恶心",
		"D": "呕吐",
		"E": "都无"
}},
	{"question": "请问腹痛的描述为?",
	"option": {
		"A": "排黑色软便",
		"B": "大便带白色粘液",
		"D": "都无"
	}
}]
  }
})